## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                      NAME                      |
|----------|------------------------------------------------|
| update   | `aws_ecs_service.saas-procurement-app-service` |
|          | `aws_security_group.ecs_tasks`                 |
|          | `aws_security_group_rule.ecs_egress_database`  |
| recreate | `aws_ecs_task_definition.saas_procurement`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.saas-procurement-app-service will be updated in-place
  ~ resource "aws_ecs_service" "saas-procurement-app-service" {
        id                                 = "arn:aws:ecs:ca-central-1:394954348146:service/saas-procurement-cluster/saas_procurement-service"
        name                               = "saas_procurement-service"
        tags                               = {
            "CostCentre" = "saas-procurement"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task:12" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.saas_procurement must be replaced
-/+ resource "aws_ecs_task_definition" "saas_procurement" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task:12" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - environment      = [] -> null
                  - essential        = true -> null
                  - mountPoints      = [] -> null
                    name             = "saas-procurement"
                  + secrets          = [
                      + {
                          + name      = "APPROVED_REQUEST_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "REQUEST_S32_APPROVED_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "POSTGRES_PASSWORD"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "ENVIRONMENT"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "DJANGO_SECRET_KEY"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "APPROVER_DELETE_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "SOCIAL_APPLICATION_CLIENT_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "SAAS_SUBMISSION_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "EDIT_REQUEST_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "DELETE_SAAS_REQUEST_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "SAAS_SUBMISSION_EDIT_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "DENIED_REQUEST_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "NOTIFY_URL"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "NOTIFY_API_KEY"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "APPROVAL_REQUEST_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "REQUEST_S32_DENIED_INTERNAL_OPS_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "DB_HOST"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "INTERNAL_OPS_REQUEST_MORE_INFO_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "POSTGRES_USER"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "REQUEST_S32_DENIED_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "S32_APPROVAL_REQUESTED_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "POSTGRES_DB"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "REQUEST_S32_APPROVED_INTERNAL_OPS_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "REQUESTOR_S32APPROVAL_PENDING_REVIEW_TEMPLATE_ID"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "SOCIAL_APPLICATION_SECRET_KEY"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "TESTING_FEATURE_FLAG"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "SITE_ID"
                          + valueFrom = ""
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "saas-procurement-task" -> (known after apply)
      ~ revision                 = 12 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = null
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-051638cd60aef88c3",
                ]
              - self             = false
              - to_port          = 5432
            },
        ]
        id                     = "sg-0d1ca7e7e561a219f"
        name                   = "saas-procurement-security-group"
        tags                   = {
            "CostCentre" = "saas-procurement"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_security_group_rule.ecs_egress_database will be updated in-place
  ~ resource "aws_security_group_rule" "ecs_egress_database" {
      + description              = "Allow ECS to talk to the RDS cluster"
        id                       = "sgrule-3706790936"
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.saas_procurement_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.saas-procurement-app-service"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]

26 tests, 17 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
